#ifndef INTERFACE_H_INCLUDED
#define INTERFACE_H_INCLUDED
#include "database.h"
#include <stdio.h>

/** Очищает графическое окно, выводит базу данных list в виде таблицы
 *  рисует кнопки "закрыть", "сохранить", "сохранить как"
 *  и кнопку "+" - добавление нового элемента в базу даныых
 */
void table (dtb list);


/** Ввод названия улицы в таблицу в графическом окне
 *  left, top, right, bottom - координаты изменяемой ячейки
 *  Возвращает указатель на строку с введённым названием
 *  или NULL, если ввод отменён или не удалось выделить память
 *  завершения ввода - Enter, отмена ввода - Home
 */
char * input_name (int left, int top, int right , int bottom);


/** Ввод длины улицы в таблицу в графическом окне
 *  left, top, right, bottom - координаты изменяемой ячейки
 *  Возвращает введённое число или NULL, если ввод отменён или не удалось выделить память
 *  завершения ввода - Enter, отмена ввода - Home
 */
double input_length (int left, int top, int right , int bottom);


/** Ввод количества домов на улице в таблицу в графическом окне
 *  left, top, right, bottom - координаты изменяемой ячейки
 *  Возвращает введённое число или NULL, если ввод отменён или не удалось выделить память
 *  завершения ввода - Enter, отмена ввода - Home
 */
double input_houses (int left, int top, int right , int bottom);


/** Ввод имени файла в графическом окне
 *  Возвращает указатель на строку с введённым именем
 *  или NULL, если ввод отменён или не удалось выделить память
 *  завершения ввода - Enter, отмена ввода - Home
 */
char * input_filename ();


/** Рисует столбчатую диаграмму по элеметам базы данных list
 *  cmp - функция сравнения двух элементов массива list.street_list (возвращает 1, если a < b, иначе 0)
 *  div - функция деления двух элементов массива
 */
void bar_chart(dtb list, fnc_comp cmp, fnc_divide div);


/** Рисует круговую диаграмму по элеметам базы данных list
 *  list_sum - функция суммирования всех элементов массива list.street_list
 *  div - функция деления элемента массива на вещественное число
 */
void pie_chart(dtb list, fnc_sum list_sum, fnc_divide_num div);


/** Работа с базой данных list в графическом окне
 *  Обрабатывает положение и нажатия мыши
 *  filename - имя файла, из которго прочитана база данных
 */
void interface (dtb list, const char *filename);

#endif // INTERFACE_H_INCLUDED
